Revit 2020 API
HermiteSpline Properties
The HermiteSpline type exposes the following members.
Properties
Name | Description
ApproximateLength
The approximate length of the curve.
 (Inherited from Curve.)
ControlPoints
The control points of the Hermite spline.
GraphicsStyleId
The ElementId of the GeometryObject's GraphicsStyle
 (Inherited from GeometryObject.)
IsBound
Describes whether the parameter of the curve is restricted to a particular interval.
 (Inherited from Curve.)
IsCyclic
The boolean value that indicates whether this curve is cyclic.
 (Inherited from Curve.)
IsElementGeometry
Indicates whether this geometry is obtained directly from an Element.
 (Inherited from GeometryObject.)
IsPeriodic
Returns whether the Hermite spline is periodic or not.
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
Length
The exact length of the curve.
 (Inherited from Curve.)
Parameters
Returns the params of the Hermite spline.
Period
The period of this curve.
 (Inherited from Curve.)
Reference
Returns a stable reference to the curve.
 (Inherited from Curve.)
Tangents
Returns the tangents of the Hermite spline.
Visibility
The visibility.
 (Inherited from GeometryObject.)
See Also
HermiteSpline Class
Autodesk.Revit.DB Namespace